In [ ]:
import pandas as pd

In [ ]:
dados = {'cars':['BMW', 'Volvo', 'Ford'],'passageiros':[3,7,2]}

In [ ]:
pd = pd.DataFrame(dados)

In [ ]:
## Verificando a versão do pandas

pd.__version__

'2.1.0'

# Trabalhando com pandas Series

In [ ]:
idade = pd.Series([15,20,25,30,40,50,60])

In [ ]:
idade

0    15
1    20
2    25
3    30
4    40
5    50
6    60
dtype: int64

In [ ]:
# Retornar apenas os valores da serie de dados

idade.values

array([15, 20, 25, 30, 40, 50, 60], dtype=int64)

In [ ]:
# Retornar aprenas os indices dos registros

idade.index

RangeIndex(start=0, stop=7, step=1)

In [ ]:
# Alterando os indices

indice_novo = ['Ana', 'Amanda', 'Jaqueline', 'Larissa', 'Roberto','João', 'Alan']

In [ ]:
idade_list = [15,20,25,30,40,50,60]
nova_serie = pd.Series(data=idade_list, index=indice_novo)

In [ ]:
nova_serie

Ana          15
Amanda       20
Jaqueline    25
Larissa      30
Roberto      40
João         50
Alan         60
dtype: int64

## Acessando inforamçoes de uma serie

In [ ]:
nova_serie['João']

50

# Trabalhando com DataFrame

In [ ]:
dados = {'calorias':[420,380,390], 'duracao':[50,40,45]}

In [ ]:
import pandas as pd
df = pd.DataFrame(dados)

In [ ]:
df

   calorias  duracao
0       420       50
1       380       40
2       390       45

In [ ]:
df['calorias']

0    420
1    380
2    390
Name: calorias, dtype: int64

In [ ]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
caminho = 'C:\\Users\\FIC\\Documents\\Rafael-Dias-Python\\arquivos\\'
arquivo = 'bank-full.xlsx'

In [ ]:
print(caminho + arquivo)

C:\Users\FIC\Documents\Rafael-Dias-Python\arquivos\bank-full.xlsx

In [ ]:
!pip install openpyxl

Collecting openpyxl

[notice] A new release of pip available: 22.3 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     -------------------------------------- 250.0/250.0 kB 5.2 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [ ]:
df = pd.read_excel(caminho + arquivo, sheet_name = 'Sheet 1 - bank-full')

## Visualizando o cabeçalho do DataFrame

Podemos verificar o cabeçalho do dataframe utilizando o campo df.head()

In [ ]:
df.head(10)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown
5,35,management,married,tertiary,no,231,yes,no,unknown,5,may,139,1,-1,0,unknown
6,28,management,single,tertiary,no,447,yes,yes,unknown,5,may,217,1,-1,0,unknown
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,5,may,380,1,-1,0,unknown
8,58,retired,married,primary,no,121,yes,no,unknown,5,may,50,1,-1,0,unknown
9,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown

## Visualizando o final do DataFrame

Podemos verificar o final do DataFrame com o comando df.tail()

In [ ]:
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

## Renomeando as colunas do DataFrame

In [ ]:
df.columns = ['idade','trabalho','estado civil','educacao','default','balance','housing','loan','contato','dia','mes','duration','campaign','pdays','previous','poutcome']

In [ ]:
df.head()

,idade,trabalho,estado civil,educacao,default,balance,housing,loan,contato,dia,mes,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

## Obtendo algumas informações sobre o DataFrame

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 16 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   idade         45211 non-null  int64
 1   trabalho      45211 non-null  object
 2   estado civil  45211 non-null  object
 3   educacao      45211 non-null  object
 4   default       45211 non-null  object
 5   balance       45211 non-null  int64
 6   housing       45211 non-null  object
 7   loan          45211 non-null  object
 8   contato       45211 non-null  object
 9   dia           45211 non-null  int64
 10  mes           45211 non-null  object
 11  duration      45211 non-null  int64
 12  campaign      45211 non-null  int64
 13  pdays         45211 non-null  int64
 14  previous      45211 non-null  int64
 15  poutcome      45211 non-null  object
dtypes: int64(7), object(9)
memory usage: 5.5+ MB

## Estatísticas básicas

A função describe() exibe as estastitiscas basicas dos dados numericos

In [ ]:
df.describe()

,idade,balance,dia,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

## Estatísticas de dados categóricos (não numericos)

Para estatísticas de variaveis categorios, precisamos adicionar o argumento include=['0']

In [ ]:
df.describe(include=['O'])

,trabalho,estado civil,educacao,default,housing,loan,contato,mes,poutcome
count,45211,45211,45211,45211,45211,45211,45211,45211,45211
unique,12,3,4,2,2,2,3,12,4
top,blue-collar,married,secondary,no,yes,no,cellular,may,unknown
freq,9732,27214,23202,44396,25130,37967,29285,13766,36959

In [ ]:
# Vai trazer estatisticas de todos o tipos de dados
df.describe(include='all')

,idade,trabalho,estado civil,educacao,default,balance,housing,loan,contato,dia,mes,duration,campaign,pdays,previous,poutcome
count,45211.000000,45211,45211,45211,45211,45211.000000,45211,45211,45211,45211.000000,45211,45211.000000,45211.000000,45211.000000,45211.000000,45211
unique,NaN,12,3,4,2,NaN,2,2,3,NaN,12,NaN,NaN,NaN,NaN,4
top,NaN,blue-collar,married,secondary,no,NaN,yes,no,cellular,NaN,may,NaN,NaN,NaN,NaN,unknown
freq,NaN,9732,27214,23202,44396,NaN,25130,37967,29285,NaN,13766,NaN,NaN,NaN,NaN,36959
mean,40.936210,NaN,NaN,NaN,NaN,1362.272058,NaN,NaN,NaN,15.806419,NaN,258.163080,2.763841,40.197828,0.580323,NaN
std,10.618762,NaN,NaN,NaN,NaN,3044.765829,NaN,NaN,NaN,8.322476,NaN,257.527812,3.098021,100.128746,2.303441,NaN
min,18.000000,NaN,NaN,NaN,NaN,-8019.000000,NaN,NaN,NaN,1.000000,NaN,0.000000,1.000000,-1.000000,0.000000,NaN
25%,33.000000,NaN,NaN,NaN,NaN,72.000000,NaN,NaN,NaN,8.000000,NaN,103.000000,1.000000,-1.000000,0.000000,NaN
50%,39.000000,NaN,NaN,NaN,NaN,448.000000,NaN,NaN,NaN,16.000000,NaN,180.000000,2.000000,-1.000000,0.000000,NaN
75%,48.000000,NaN,NaN,NaN,NaN,1428.000000,NaN,NaN,NaN,21.000000,NaN,319.000000,3.000000,-1.000000,0.000000,NaN
max,95.000000,NaN,NaN,NaN,NaN,102127.000000,NaN,NaN,NaN,31.000000,NaN,4918.000000,63.000000,871.000000,275.000000,NaN

## Selecionar dados

In [ ]:
# selecionando apenas uma coluna

df.idade
#OU
df['idade']

0        58
1        44
2        33
3        47
4        33
         ..
45206    51
45207    71
45208    72
45209    57
45210    37
Name: idade, Length: 45211, dtype: int64

## Selecionando mais de uma coluna

In [ ]:
df[['idade','dia','estado civil']]

       idade  dia estado civil
0         58    5      married
1         44    5       single
2         33    5      married
3         47    5      married
4         33    5       single
...      ...  ...          ...
45206     51   17      married
45207     71   17     divorced
45208     72   17      married
45209     57   17      married
45210     37   17      married

[45211 rows x 3 columns]